Tutorial/Re5000/0.orig/C_ox
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_ox;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

#include "include/initialConditions"

internalField   uniform 0;

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        type            zeroGradient;
        //value           uniform 0;
    }
    wall_cathode
    {
        
        type            fixedValue;
        value           uniform 0;
    }

    #include "include/constantPatches"
}

// ************************************************************************* //
