Tutorial/Re5000/0.orig/fi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      fi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// #include "include/controlProperties"
#include "include/initialConditions"

dimensions      [1 2 -3 0 0 -1 0];// V = kg*m^2/(A*s^3)

internalField   uniform	1;//#calc "(mag($ref)+$maxPot)/2";

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"

    "wall.*"
    {
        type            zeroGradient;
        value           $internalField;
    }

    #include "include/constantPatches"

   /* wall_anode       
    {

    //type	fixedGradient;
    //gradient	uniform 7.7519; //j/kappa  

    type            codedMixed;
    
    refValue        uniform #calc "($maxPot-mag($ref))";//$internalField;//
    refGradient     uniform 0;
    valueFraction   uniform 1;

    name    anode_fi;   // name of generated BC

    code
    #{
        const fvPatch& p = this->patch();                                                                          // Actual boundary/patch
    	label patchID = p.patch().boundaryMesh().findPatchID("wall_anode");                                       // Desired patch ID
        const fvMesh& mesh = patch().boundaryMesh().mesh();

        
        const volScalarField& kf_ = this->db().objectRegistry::template lookupObject<volScalarField>("keff");   // Desired field 1
        const volScalarField& fi_ = this->db().objectRegistry::template lookupObject<volScalarField>("fi"); // Desired field 2
        const volScalarField& Con_red = this->db().objectRegistry::template lookupObject<volScalarField>("C_red");   // Desired field 3
        const volScalarField& Con_ox = this->db().objectRegistry::template lookupObject<volScalarField>("C_ox");

        scalarField kf_boundary = kf_.boundaryField()[patchID];                                              
        scalarField fi_boundary = fi_.boundaryField()[patchID];                                           
        scalarField C_red_boundary = Con_red.boundaryField()[patchID];                            
	scalarField C_ox_boundary = Con_ox.boundaryField()[patchID]; 
        
        scalarField delta = 1.0/mesh.deltaCoeffs().boundaryField()[patchID]; 

        const dictionary& kineticProperties = db().lookupObject<IOdictionary>("transportProperties");
        const dictionary& Results = db().lookupObject<IOdictionary>("Results");
        
        
        scalar j0_Ni = readScalar(kineticProperties.lookup("j0_Ni")); 
        scalar ba_Ni = readScalar(kineticProperties.lookup("ba_Ni"));
       	scalar bc_Ni = readScalar(kineticProperties.lookup("bc_Ni"));
	scalar j0_O2= readScalar(kineticProperties.lookup("j0_O2"));
        scalar ba_O2 = readScalar(kineticProperties.lookup("ba_O2"));
	scalar E0_O2 = readScalar(kineticProperties.lookup("E0_O2"));

        scalar C_redinf = readScalar(kineticProperties.lookup("C_redinf")) ;
	scalar C_oxinf = readScalar(kineticProperties.lookup("C_oxinf")) ;

        scalar Vcell = readScalar(Results.lookup("Vcell"));
 	const dictionary& controlProperties = db().lookupObject<IOdictionary>("controlProperties");
	scalar maxPot = readScalar(controlProperties.lookup("maxPot"));
	scalar ref = readScalar(controlProperties.lookup("ref"));
	Vcell = max(min(Vcell, maxPot),ref); // limited potentials

        scalarField jota1 = j0_Ni*C_red_boundary/C_redinf*exp((Vcell-fi_boundary)/ba_Ni);                    
        scalarField jota2 = -j0_Ni*C_ox_boundary/C_oxinf*exp((Vcell-fi_boundary)/bc_Ni);
	scalarField jota3 = j0_O2*exp((Vcell-fi_boundary-E0_O2)/ba_O2);
	scalarField k0 = kf_boundary/delta;
                                                         
        scalarField A = (1/k0)*(jota1/ba_Ni+jota2/bc_Ni+jota3/ba_O2);                            
	scalarField B = (1/k0)*((1+fi_boundary/ba_Ni)*jota1+(1+fi_boundary/bc_Ni)*jota2+(1+fi_boundary/ba_O2)*jota3); 
         
        this->refValue() = B/A;
        this->refGrad() = 0;
        this->valueFraction() = A/(A+1); 
    #};
 
    codeInclude
    #{
        #include "fvCFD.H"
        #include "fvcSnGrad.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
    #};

    }

    wall_cathode      
    {

    type            codedMixed;
    
    refValue        uniform #calc "(mag($ref))";//$internalField;//
    refGradient     uniform 0;
    valueFraction   uniform 1;

    name    cathode_fi;   // name of generated BC

    code
    #{
        const fvPatch& p = this->patch();                                                                          // Actual boundary/patch
    	label patchID = p.patch().boundaryMesh().findPatchID("wall_cathode");                                       // Desired patch ID
        const fvMesh& mesh = patch().boundaryMesh().mesh();

        const volScalarField& kf_ = this->db().objectRegistry::template lookupObject<volScalarField>("keff");   // Desired field 1
        const volScalarField& fi_ = this->db().objectRegistry::template lookupObject<volScalarField>("fi"); // Desired field 2
        const volScalarField& Con_ox = this->db().objectRegistry::template lookupObject<volScalarField>("C_ox");   // Desired field 3
        
        scalarField kf_boundary = kf_.boundaryField()[patchID];                                              
        scalarField fi_boundary = fi_.boundaryField()[patchID];                                            
        scalarField C_ox_boundary = Con_ox.boundaryField()[patchID];                                            

        scalarField delta = 1.0/mesh.deltaCoeffs().boundaryField()[patchID]; 

        const dictionary& kineticProperties = db().lookupObject<IOdictionary>("transportProperties");
  
        scalar j0_SS316 = readScalar(kineticProperties.lookup("j0_SS316"));
        scalar bc_SS316 = readScalar(kineticProperties.lookup("bc_SS316"));
	scalar ba_SS316 = readScalar(kineticProperties.lookup("ba_SS316"));
        scalar j0_H2 = readScalar(kineticProperties.lookup("j0_H2"));
        scalar bc_H2 = readScalar(kineticProperties.lookup("bc_H2"));
        scalar E0_H2 = readScalar(kineticProperties.lookup("E0_H2"));
	
	scalar C_oxinf = readScalar(kineticProperties.lookup("C_oxinf"));
 
        scalarField jota1 = -j0_SS316*C_ox_boundary/C_oxinf*exp((-fi_boundary)/bc_SS316);                                                        
        scalarField jota2 = j0_SS316*exp((-fi_boundary)/ba_SS316);
	scalarField jota3 = -j0_H2*exp((-fi_boundary-E0_H2)/bc_H2);
        scalarField k0 = kf_boundary/delta;                                                                      
        
	scalarField A = (1/k0)*(jota1/bc_SS316+jota2/ba_SS316+jota3/bc_H2);       
	scalarField B = (1/k0)*((1+fi_boundary/bc_SS316)*jota1+(1+fi_boundary/ba_SS316)*jota2+(1+fi_boundary/bc_H2)*jota3); 
        
	this->refValue() = B/A;
        this->refGrad() = 0;
        this->valueFraction() = A/(A+1); 
    #};
 
    codeInclude
    #{
        #include "fvCFD.H"
        #include "fvcSnGrad.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
    #};
    }  
    
    "(inlet|outlet)" //|front|back
    {
        type            cyclicAMI;//cyclic;
        value           $internalField;//uniform $C_oxinf;//
    }
    "front.*"
    {
        type            empty;   
    }   */
}

// ************************************************************************* //
