Tutorial/Re5000/0.orig/include/constantPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      constantPatches;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{
    type            cyclicAMI;
    value           $internalField;
}
outlet
{
    type            cyclicAMI;
    value           $internalField;
}
// inlet2
// {
//     type            cyclicAMI;
//     value           $internalField;
// }
// outlet2
// {
//     type            cyclicAMI;
//     value           $internalField;
// }
// "(ymax|ymin)"
// {
//     type            cyclicAMI;
//     value           $internalField;
// }

// "(xmax|xmin)"
// {
//     type            cyclicAMI;
//     value           $internalField;
// }

"(front|back)"
{
    type            empty;
}
// ************************************************************************* //
