Tutorial/Re5000/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

#include "include/initialConditions"

internalField   uniform $turbulentOmega;

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"

    "wall.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    #include "include/constantPatches"
}


// ************************************************************************* //
