Tutorial/Re5000/constant/controlProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// control variables

control 2; //1- potentiostatic mode 2- fixed cell potential 3- galvanostatic mode

alpha 1.3;//under-over relaxation parameter (recomended values are 0.3 for mode 1, 1 for mode 2 and 1.3 for mode 3)

maxPot 2.5; // max cell potential you expect (when control = 1 or 3) or cell potential (when control = 2)

// When control == 1

ref -1.5; // set potential vs reference (when control = 1) // <0 for cathodic processes >0 for anodic ones

tol_ref 0.002; //set tolerance for finding the Vcell and Icell for a given ref potential

maxvar 0.1; //maximal variability of Vcell (when control = 1)

refLocation (0.05 0 0.075); //position of ref electrode (x y z)

// When control == 3

I 1; //total current (when control = 3)

tol_I 0.002; // tolerance to the desire current


// ************************************************************************* //
