Tutorial/Re5000/constant/speciesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      speciesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ox
{
    diffusionModel  constant;
    D	D	[0 2 -1 0 0 0 0]	5e-10;// nut/Sc
}

/*red
{
    diffusionModel  constant;
    D	D	[0 2 -1 0 0 0 0]	7.2e-10;
}*/

// ************************************************************************* //
