Tutorial/Re5000/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  24;

method              hierarchical;

simpleCoeffs
{
    n               (6 4 1);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (6 4 1);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

constraints
{
    preservePatches
    {
        type            preservePatches;
        patches         (inlet);
    }
}

// ************************************************************************* //
