Tutorial/Re5000/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linear;//linearUpwind grad(U);//bounded Gauss linear;//upwind;//linear;//limitedLinear 0.2;

    energy          bounded Gauss linear;//limitedLinear 1;//bounded Gauss linear;//upwind;//limitedLinear 0.2;
    div(phi,K)      $energy;
    div(phi,h)      $energy;
    div(phi,cBar)      $energy;
    div(phi,C_ox)      $energy;
    div(phi,T)      $energy;

    turbulence      bounded Gauss linear;//limitedLinear 1;//bounded Gauss linear;//upwind;//limitedLinear 0.2;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;
    div(phi,omega) $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;//un
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;//un
}

fluxRequired
{
    default         yes;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
