Tutorial/Re5000/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;//0.01;
    }

    "(U|cBar|T|C_ox|k|epsilon|omega)"
    {
        //solver          smoothSolver;
        //smoother        symGaussSeidel;
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;//0.01;
    }
}

SIMPLE
{
    momentumPredictor yes;//no;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

     residualControl
     {

         U               1e-6;

         cBar            1e-6;
         C_ox            1e-6;
    //     T               1e-6;
         "(k|epsilon|omega)" 1e-6;
     }
}

relaxationFactors
{
    fields
    {
        p	0.3;
        //rho             1.0;
        //p_rgh           0.7;
    }
    equations
    {
        U               0.8;
        "(cBar|C_ox|T)"  1;
        "(k|epsilon|omega)" 0.9;
    }
}


// ************************************************************************* //
